export type Merchant = {
  'merchantId': string // Унікальний ідентифікатор мерчанта, який надається при реєстрації
  'merchantName': string // Назва мерчанта, яка буде відображатися в чекових документах
  'edrpou': string // ЄДРПОУ мерчанта, обов’язковий для фіскалізації
}

export type Discount = {
  type: 'DISCOUNT' | 'EXTRA_CHARGE' // Тип знижки або надбавки
  mode: 'PERCENT' | 'VALUE' // Режим знижки або надбавки PERCENT — відсоток від basketOrder.sum * basketOrder.qty | VALUE — числове значення
  value: null // Значення, яке буде фігурувати в розрахунках >= 0.01
}

export type Product = {
  code: string // Код товару, обов’язковий для фіскалізації
  name: string // Назва товару
  qty: number // Кількість одиниць товару
  sum: number // Вартість у мінімальних одиницях валюти за одиницю товару
  total?: number // Сума у мінімальних одиницях валюти за всю кількість товарів
  icon?: string // URL зображення товару
  unit?: string // Назва одиниці вимiру товару
  barcode?: string // Значення штрих-коду, може бути потрібно для фіскалізації
  header?: string // Текст, що передує назві товару, може бути потрібний для фіскалізації
  footer?: string // Текст, після товару, може бути потрібний для фіскалізації
  tax?: number[] // Масив податкових ставок, які було обрано на порталі Checkbox при реєстрації каси. При використанні ПРРО monopay податкові ставки наразі не застосовуються
  uktzed?: string // Код УКТ ЗЕД
  splitReceiverId?: string // Для схеми розщеплення - референс саб-мерчанта для виплати за товар
  discounts?: Discount[] // Масив знижок або надбавок на цю позицію в корзині, які будуть передані в checkbox для фіскалізації, якщо звʼязку з checkbox активовано
}

export type MerchantPayInfo = {
  reference: string // Номер чека, замовлення, тощо; визначається мерчантом
  destination: string // Призначення платежу, наприклад: "Оплата за товар", "Покупка послуги" тощо, не більше 280 символів
  comment?: string // Службове інформаційне поле, не більше 280 символів
  customerEmails?: string[] // Масив електронних адрес, на які потрібно відправити фіскальний чек, якщо у мерчанта активна звʼязка з checkbox
  discounts?: Discount[]
  basketOrder?: Product[] // Список товарів, які були придбані, якщо звʼязку з checkbox активовано
}

export type PaymentInfo = {
  maskedPan: string // Маскований номер картки, за якою здійснювалась оплата
  approvalCode?: string | null // Код авторизації транзакції
  rrn?: string | null // Ідентифікатор транзакції в платіжній системі
  tranId?: string // Ідентифікатор транзакції
  terminal: string // Ідентифікатор платіжного пристрою, через який пройшла транзакція
  bank?: string | null // Назва банку картки, якою проводилася оплата
  paymentSystem: 'visa' | 'mastercard' // Назва платіжної системи картки
  paymentMethod: 'pan' | 'apple' | 'google' | 'monobank' | 'wallet' | 'direct' // Метод оплати
  fee?: number // Еквайрингова комісія в мінімальних одиницях
  country?: string // Країна банку (ISO-3166-1 numeric), якому належить картка, якою була здійснена оплата
  agentFee?: number // Комісія агента в мінімальних одиницях
}

export type WalletData = {
  cardToken: string // Токен картки, якщо картка була токенізована
  walletId: string // Ідентифікатор гаманця покупця
  status: 'new' | 'created' | 'failed' // Статус токенізації картки
}

export type TipsInfo = {
  employeeId: string // Ідентифікатор співробітника, якому можна виплатити чайові
  amount?: number | null // Сума успішно сплачених чайових у мінімальних одиницях валюти. Якщо це поле відсутнє, значить успішної оплати чайових не було
}

export type Cancelation = {
  status: 'processing' | 'success' | 'failure' // Статус заяви на скасування
  amount?: number // Сума у мінімальних одиницях
  ccy?: number // ISO 4217 код валюти
  createdDate: string // Дата і час створення заяви на скасування
  modifiedDate: string // Дата і час останньої модифікації операції скасування
  approvalCode?: string | null // Код авторизації, якщо доступний
  rrn?: string | null // Ідентифікатор транзакції в платіжній системі, якщо доступний
  extRef?: string | null // Референс операції скасування, який було вказано продавцем
}
